# WallTypeDefaultTaperedInteriorInwardAngle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WallTypeDefaultTaperedInteriorInwardAngle Property
ParameterTypeId Class See Also
---
"Default Interior Angle"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WallTypeDefaultTaperedInteriorInwardAngle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallTypeDefaultTaperedInteriorInwardAngle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallTypeDefaultTaperedInteriorInwardAngle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace